[
  {
    "title": "Kondisi Makkah Pra-Kenabian",
    "description": "Makkah merupakan kota perdagangan yang strategis, didominasi oleh suku Quraisy yang terbagi dalam kelas sosial dan ekonomi, serta pusat ibadah dengan Ka'bah yang dikelilingi berhala.",
    "sirah": "Kota Makkah terletak di dasar lembah yang dikelilingi oleh gunung-gunung dari berbagai arah. Kehidupan sosial penduduk Makkah cukup kuat karena ikatan kekeluargaan dan berbagai kepentingan. Namun, kerja sama tidak terwujud tanpa perbedaan status sosial, dengan adanya kelas kaya, menengah, dan papa. Modal besar berada di tangan orang-orang kaya yang berkembang pesat melalui perdagangan dan memberikan pinjaman ribawi kepada yang membutuhkan, serta melalui pertanian di Tha'if.\n \n **Mayoritas penduduk Makkah hidup dalam kesengsaraan, sementara sebagian orang kaya makan dengan piring emas dan perak**. Perdagangan Makkah ditempuh melalui jalur laut menuju darat, namun mereka belum memiliki armada laut sendiri, hanya memanfaatkan perahu-perahu Habasyah.\n \n Sebelumnya, kawasan Makkah adalah hutan kosong tanpa bangunan, di mana pohon dianggap keramat dan tidak boleh ditebang. Namun, **Qushai, kakek Hasyim dan kakek buyut Nabi Muhammad, telah merintis pengaturan Makkah**. Dialah yang menebang pohon keramat itu, menyebabkan orang-orang berani menebangnya juga. Qushai mengatur kondisi Makkah, membagi tugas dan kewajiban kepada pengikutnya, seperti wewenang menjaga pintu Ka'bah, memberi minum dan menjamu jamaah haji, memegang panji, dan bertanggung jawab atas balai pertemuan. Qushai juga mengambil sepersepuluh dari pedagang non-Makkah yang datang ke kota, yang menjadi salah satu sumber kekayaan Makkah. Perintah Qushai di kalangan Quraisy dianggap seperti agama yang harus diikuti, sebagai pengakuan atas keutamaan dan kemuliaannya.\n \n Para pemuka Makkah dikenal sangat kuat dalam menjaga keyakinan, adat istiadat, dan kebiasaan yang berlaku, guna mengokohkan hak warisan, status sosial, dan kepentingan ekonomi mereka. Sesudah Qushai, anak-anaknya-lah yang memegang kendali wewenang tersebut. Tokoh terkemuka lainnya adalah Abdul Muththalib bin Hasyim, kakek Nabi Muhammad, yang dikenal sebagai dermawan karena kemurahan hatinya, dijuluki 'Syaibatul Hamdi' (kakeknya pujian). **Beliau dikenal sebagai penggali sumur Zamzam**, yang airnya meluap dan rasanya lebih nikmat dari sumur lain di Makkah.\n \n Masyarakat Makkah terpecah menjadi dua kelompok sentral: 'Al-Muthayyibun' (terdiri dari Bani Abdi Manaf, Bani Asad bin Abdil 'Uzza, Bani Zuhrah, Bani Tamim, Bani Al-Harits bin Fihr) dan 'Al-Ahlaf' (terdiri dari Bani Abdi Ad-Daar, Sahm, Jumah, Makhzum, dan 'Adi). Perselisihan juga terjadi dalam satu keluarga, seperti antara Umayyah bin Abdi Syams dan Hasyim bin Abi Manaf, serta anak-anak mereka Harb bin Umayyah dan Abdul Muththalib bin Hasyim. Kondisi aman dan sejahtera di Makkah sebelum Islam membantu melanggengkan posisi para pemukanya.",
    "year": "570 M - 610 M",
    "page": 1
  },
  {
    "title": "Penyimpangan Akidah dan Adat Jahiliyah",
    "description": "Akidah Jahiliyah adalah akidah yang tidak beradab kepada Allah dan Rasul, serta tidak mempunyai ketentuan tentang adat-adat istiadat Jahiliyah.",
    "sirah": "Meskipun manusia siap menerima kesyirikan, Amr bin Luhai Al-Khuza'i berani membuat kebiasaan dan ideologi di Makkah yang bertentangan dengan agama yang benar. **Nabi Muhammad sendiri menjelaskan bahwa ia pernah bermimpi Amr bin Luhai menyeret ususnya di neraka, karena dialah orang pertama yang melakukan berbagai penyimpangan**, seperti mengharamkan punggung binatang ternak sebagai nadzar kepada berhala. Para sejarawan menegaskan pengaruh Amr bin Luhai dalam penyebaran kesyirikan di Makkah dan sekitarnya.\n \n Al-Qur'an adalah referensi paling akurat tentang ideologi Jahiliyah. Orang-orang musyrik Makkah sebenarnya mengenal Allah, namun mereka menyembah selain Allah dan meminta syafaat melalui berhala-berhala yang mereka anggap sebagai tuhan. Mereka mengikuti ajaran nenek moyang mereka secara buta, tanpa mengkritisi keyakinan dengan akal atau dalil shahih.\n \n Penyimpangan akidah ini diikuti dengan penyimpangan dalam ibadah, tingkah laku, dan hukum. Manasik haji terkontaminasi paganisme, dengan berhala-berhala diletakkan di sekitar Ka'bah. Wanita thawaf di tangga-tangga longgar dan membuat aturan yang tidak diizinkan Allah, namun mengklaim berada di atas syariat Nabi Ibrahim. Persepsi mereka tentang Allah sangat dangkal, mengingkari sebagian sifat Allah, memberikan nama negatif, dan menyandarkan kekurangan pada Allah, seperti memiliki anak perempuan (malaikat) dan menjadikan jin sekutu bagi-Nya. Mereka juga mengingkari takdir dan berpendapat bahwa kehidupan hanyalah di dunia saja, mati dan hidup, dan masa yang membinasakan mereka.\n \n Dalam ibadah, mereka mengurangi atau menambah-nambah seenaknya. Perangai Jahiliyah lainnya termasuk menjelek-jelekkan orang lain karena perbuatan ibu-bapak mereka, membanggakan wewenang mengurusi Masjidil Haram, mengagungkan dunia dan harta, serta meremehkan orang fakir miskin. Ramalan, aliran tertentu, merasa sial, dan perdukunan berkembang luas. Mereka juga berlindung kepada jin karena takut.",
    "year": "Abad ke-5 M - 610 M",
    "page": 2
  },
  {
    "title": "Kisah Peristiwa Gajah",
    "description": "Peristiwa penting di mana Abrahah berusaha menghancurkan Ka'bah pada tahun 570 M, namun pasukannya dihancurkan oleh Allah sebelum mencapai Makkah.",
    "sirah": "Narasi Al-Qur'an menggambarkan peristiwa yang terjadi pada tentara bergajah. **Surah Al-Fiil (ayat 1-5) menceritakan bagaimana Allah menghancurkan pasukan bergajah Abraha yang hendak menghancurkan Ka'bah dengan mengirimkan burung Ababil yang melempari mereka dengan batu dari tanah terbakar, menjadikan mereka seperti daun-daun yang dimakan ulat**. Peristiwa ini terjadi sebelum Nabi Muhammad lahir. Ibnu Ishag menyebutkan, Aisyah sendiri pernah melihat komandan pasukan Gajah dan penuntun gajahnya yang sama-sama buta, sedang meminta makan kepada orang-orang di Makkah beberapa waktu setelah peristiwa itu. Ini menunjukkan bahwa beberapa di antara mereka tidak langsung meninggal.",
    "year": "570 M",
    "page": 3
  },
  {
    "title": "Masa Kenabian Awal dan Wahyu Pertama",
    "description": "Nabi Muhammad ﷺ menerima wahyu pertamanya di Gua Hira pada usia 40 tahun, menandai dimulainya dakwah Islam yang diawali secara sirriyah, dengan Khadijah, Ali, dan Abu Bakar sebagai muslim pertama.",
    "sirah": "Nabi Muhammad memiliki ciri fisik yang sangat tampan, berkulit putih bersih, wajah bundar, mulut lebar, mata lebar, rambut ikal yang kadang memanjang hingga bahu, dan sedikit uban. Beliau tidak terlalu besar, tidak kurus, tidak gemuk, dada lebar, tangan dan kaki besar, telapak tangan luas dan lembut. Di atas pundak kirinya terukir stempel kenabian. Musuh-musuh beliau tidak menemukan cela pada fisik beliau. Selain fisik yang sempurna, beliau juga sangat menjaga kebersihan dan penampilan.\n \n Nabi Muhammad dikenal dengan akhlak mulianya seperti kemuliaan diri, kejujuran kata dan tindakan, zuhud terhadap dunia, keikhlasan karena Allah, lidah fasih, keteguhan hati, kuat pikiran, kasih sayang kepada orang tua dan anak-anak, lemah lembut, toleran, pemaaf, dan berani mengatakan kebenaran.\n \n Di antara tanda-tanda kenabiannya adalah **batu yang pernah memberi salam kepada Nabi sebelum masa kenabian**. Permulaan turunnya wahyu adalah mimpi yang hakiki, di mana Nabi tidak melihat apapun kecuali sesuatu yang menyerupai fajar subuh yang menyingsing.\n \n Telah tumbuh pada diri Nabi kecintaan untuk mengasingkan diri guna merenung dan beribadah di Gua Hira. Suatu hari, **Malaikat Jibril datang dan berkata: “Bacalah!” Nabi menjawab: “Aku tidak bisa membaca.” Jibril memegang dan memeluk Nabi dengan sangat kuat hingga beliau merasa sesak, kemudian melepaskan dan mengulang perintah itu dua kali lagi, dengan jawaban yang sama dari Nabi**. Kemudian Jibril berkata: **“Bacalah dengan menyebut nama Tuhanmu yang telah menciptakan. Dia telah menciptakan manusia dari segumpal darah. Bacalah, dan Rabbmulah Yang Paling Pemurah. Yang mengajar (manusia) dengan perantaraan kalam. Dia mengajarkan kepada manusia apa yang tidak diketahuinya.”** (QS. Al-Alaq: 1-5).\n \n Setelah itu, **Nabi kembali dengan wahyu itu dalam keadaan gemetar**, hingga pulang menemui Khadijah dan berkata: “Selimuti aku, selimuti aku!”. Setelah rasa takutnya hilang, beliau bertanya kepada Khadijah apa yang terjadi padanya dan menyatakan kekhawatirannya. Khadijah menimpali: **“Tidak! bergembiralah! Demi Allah, selamanya Allah tidak akan menghinakanmu, karena engkau suka menyambung tali silaturrahmi, jujur dalam bertutur kata, ikut meringankan beban orang lain, menjamu tamu, dan suka menolong orang yang menegakkan kebenaran.”**. Selanjutnya, Khadijah membawa Rasulullah menemui Warqah bin Naufal, sepupu Khadijah, yang memeluk agama Nasrani semasa Jahiliyah dan bisa menulis Injil dalam bahasa Arab. Warqah sudah tua dan buta. Ketika mendengar kisah Nabi, Warqah berkata: **“Ini adalah Namus (Jibril) yang pernah datang kepada Musa. Aku berangan-angan seandainya aku masih muda dan seandainya aku masih hidup ketika kaummu mengusirmu.”**. Nabi terheran mendengar perkataan Warqah, karena beliau dicintai kaumnya. Warqah menjelaskan bahwa itu adalah sunah dalam kehidupan; setiap Nabi yang mengajak kaumnya meninggalkan tradisi Jahiliyah akan dimusuhi dan diintimidasi.\n \n **Wahyu sempat terputus selama beberapa masa**, ada yang mengatakan dua setengah tahun. Nabi sangat bersedih hingga beberapa kali berniat terjun dari puncak gunung, namun Jibril muncul dan berkata: “Wahai Muhammad, engkau adalah benar-benar Rasul Allah.” Hal ini menentramkan hati beliau. Peristiwa ini dikuatkan oleh beberapa riwayat, meskipun ada yang mursal dhaif.",
    "year": "610 M - 622 M",
    "page": 4
  },
  {
    "title": "Gangguan Quraisy di Makkah",
    "description": "Kaum Quraisy di Makkah melancarkan berbagai bentuk gangguan dan tekanan terhadap Nabi Muhammad ﷺ dan para pengikutnya, yang mendorong umat Islam untuk mencari perlindungan melalui hijrah.",
    "sirah": "Periode dakwah terang-terangan di Makkah memicu kaum musyrikin untuk mengganggu Rasulullah dan para sahabatnya. Di antara gangguan yang disaksikan adalah **Abdullah bin Mas'ud melihat Rasulullah shalat di Ka'bah, lalu salah seorang Quraisy mengambil kotoran unta beserta darah dan isi perutnya, kemudian meletakkannya di atas pundak Nabi saat beliau sujud**. Quraisy tertawa terbahak-bahak hingga tubuh mereka berguncang. Fatimah, putri Nabi, datang dan membersihkan kotoran itu. Nabi Muhammad tidak berdoa keburukan atas gangguan itu, melainkan karena mereka mendustakan dan mengingkari keimanan. Beliau mampu bersabar dan bahkan mendoakan hidayah bagi mereka.\n \n Pernah Abu Jahal bersumpah akan menginjak leher atau melumuri wajah Nabi dengan tanah jika melihat beliau shalat. Ketika ia mendekati Nabi yang sedang shalat, mereka dikejutkan oleh sikap Abu Jahal yang justru mundur sambil melindungi diri dengan kedua tangannya. Ia menjelaskan: **“Sesungguhnya antara aku dan dirinya terdapat jurang dari api, dan makhluk yang besar bersayap.”**. Rasulullah berkomentar: “Seandainya ia mendekat padaku, niscaya malaikat akan mencabik-cabiknya sepotong demi sepotong.”.\n \n Quraisy juga menuduh Nabi sebagai orang gila. Ketika Nabi menerima wahyu, beliau berada dalam kondisi konsentrasi tinggi. Wahyu datang kepadanya menyerupai bunyi gemerincing lonceng, yang paling berat baginya. Terkadang malaikat muncul dalam rupa laki-laki dan berbicara kepadanya. \n \n **Tekanan Quraisy terhadap kaum Muslimin meningkat hingga puncak kebrutalan, terutama terhadap orang-orang lemah**. Contohnya adalah Bilal bin Rabah, yang disiksa dengan menindihkan batu besar di dadanya. Abu Bakar membebaskan banyak budak Muslim yang lemah yang disiksa, seperti Bilal, Amir bin Fuhairah, Zunairoh, An-Nahdiyah, dan putrinya. Ketika Zunairoh buta karena penyiksaan, kaum musyrikin berkata Latta dan Uzza-lah yang membuatnya buta, namun Zunairoh menolaknya, dan Allah mengembalikan penglihatannya. Abu Bakar melakukan ini semata-mata karena Allah, bukan mengharap perlindungan.\n \n **Kaum Muslimin pada masa itu diperintahkan untuk memberi maaf dan tidak melawan kekuatan dengan kekuatan**. Hikmahnya adalah untuk membentengi kehidupan mereka dan mencegah stagnasi dakwah di awal perkembangannya. Nabi mendidik para sahabat untuk erat hubungannya dengan Allah dan mendekatkan diri dengan ibadah, seperti shalat malam hingga kaki bengkak.",
    "year": "610 M - 622 M",
    "page": 5
  },
  {
    "title": "Hijrah ke Habasyah",
    "description": "Ketika tekanan di Makkah memuncak, Nabi Muhammad ﷺ mengizinkan para sahabatnya untuk hijrah ke Habasyah dalam dua gelombang demi mencari perlindungan di bawah raja yang adil.",
    "sirah": "Rasulullah berkata kepada para sahabat: **“Sesungguhnya di Negeri Habasyah ada seorang raja yang tak seorang pun yang dizalimi di sisinya, pergilah ke negerinya, hingga Allah membukakan jalan keluar bagi kalian dan penyelesaian atas peristiwa yang menimpa kalian.”**. Maka para sahabat keluar secara mengendap-endap dan tinggal di Habasyah dengan aman.\n \n Kisah hijrah Ummu Salamah juga menyoroti kesulitan ini. Dia hendak hijrah bersama anaknya, namun keluarganya (Bani Mughirah) dan keluarga suaminya (Bani Abdil Asad) berselisih, masing-masing ingin menahannya dan anaknya. Ummu Salamah dan anaknya akhirnya berhasil hijrah dengan bantuan Utsman bin Thalhah, yang menjaga mereka dalam perjalanan. Kisah ini menunjukkan kendala yang dihadapi muhajirin dan fanatisme golongan.",
    "year": "615 M - 622 M",
    "page": 6
  },
  {
    "title": "Islamnya Umar bin Khattab",
    "description": "Umar bin Khattab memeluk Islam pada periode Makkah, sebuah peristiwa yang menguatkan posisi kaum Muslimin meskipun ia sendiri tidak memiliki riwayat sahih tentang rincian keislamannya.",
    "sirah": "Umar bin Khattab ﷺ disebutkan sebagai salah satu 'pemuka-pemuka' yang 'dengan rela masuk Islam' pada periode Makkah. Keislaman beliau terjadi seiring dengan makin keras dan nekatnya kaum Quraisy terhadap Rasulullah ﷺ. Namun, **rincian riwayat keislamannya tidaklah sahih**. Terdapat riwayat lemah yang menyatakan ia pernah menampar saudara perempuannya (Fatimah). Meskipun demikian, Umar adalah salah satu sahabat yang berhijrah dari Makkah ke Madinah, ia berusaha merahasiakan kepergiannya meskipun akhirnya dihadang oleh pihak Quraisy. Kisah hijrahnya Umar bin Khattab ﷺ dipaparkan secara rinci olehnya sendiri, menunjukkan tekadnya meskipun menghadapi godaan dan bujuk rayu Quraisy. Pada masa itu, orang-orang seperti Ayyasy bin Abi Rabi'ah, yang kemudian dianiaya kembali ke Makkah, menjadi pelajaran tentang bahaya kembali kepada kekufuran setelah mengenal Allah. Umar juga mencatat ayat Al-Qur'an (QS. Az-Zumar: 53-55) yang menegaskan taubat bagi orang yang kembali.",
    "year": "Sekitar 616 M",
    "page": 7
  },
  {
    "title": "Bai'at Aqabah Kedua",
    "description": "Pada tahun ke-13 kenabian, Rasulullah ﷺ menerima janji setia dari 70 laki-laki dan beberapa wanita Anshar di Aqabah untuk melindunginya dan mendukung dakwah Islam di Madinah, menjadi pondasi Hijrah.",
    "sirah": "Setelah Rasulullah ﷺ berkeliling ke berbagai kabilah mencari dukungan dan perlindungan, hubungan dengan kaum Anshar dimulai pada musim haji dan umrah. **Bai'at Aqabah Kedua terjadi pada tahun ke-13 kenabian**. Rasulullah ﷺ menetap di Makkah selama sepuluh tahun, mengajak manusia masuk Islam, dan berkeliling di pasar-pasar seperti Ukazh dan Majinnah.\n \n Pada musim haji, 70 orang lelaki dan beberapa wanita dari kaum Anshar datang menemui beliau di lorong Aqabah untuk berbai'at. Mereka berjanji untuk mendengar dan taat dalam keadaan giat maupun malas, berinfak, dan paling penting, **melindungi Rasulullah ﷺ sebagaimana mereka melindungi anak dan istri mereka sendiri, bahkan jika musuh menyerbu beliau di luar Madinah**. Abbas bin Abdul Muththalib, paman Rasulullah ﷺ, juga hadir untuk memastikan keseriusan Anshar dalam melindungi Nabi ﷺ di Madinah. Bai'at ini berhasil terlaksana dengan sukses, dan kaum Anshar kembali ke Madinah dengan penuh harap menunggu hijrah Nabi ﷺ. Perjanjian ini menjadi fondasi penting bagi hij yang ditunjukkan melalui mimpi beliau ﷺ. Rasulullah ﷺ tetap tinggal di Makkah setelah haji, sisa bulan Dzulhijjah, Muharram, dan Safar, lalu kaum musyrikin Quraisy membuat kesepakatan untuk membunuh beliau. Beliau ﷺ keluar dari Makkah pada hari Senin dan masuk Madinah pada hari Senin pula. Kaum Quraisy berusaha menghalangi hijrah kaum Muslimin dengan berbagai cara, termasuk merampas harta, menyekap istri dan anak-anak mereka,irin singgah di Quba' terlebih dahulu sebelum kedatangan Rasulullah ﷺ. Ketika kaum Muslimin di Madinah mendengar kedatangan Rasulullah ﷺ, mereka setiap pagi menunggu kedatangan beliau di luar kota dengan penuh kebahagiaan. Seorang Yahudi menjadi orang pertama yang melihat beliau dari kejauhan dan memanggil kaum Muslimin. Rasulullah ﷺ singgah di Quba' selama empat belas malam dan mendirikan Masjid Quba'. Kemudian beliau memasuki Madinah dan membangun Masjid Nabawi. **Peristiwa Hijrah ini menjadi titik awal penang",
    "year": "622 M",
    "page": 8
  },
  {
    "title": "Hijrah ke Madinah",
    "description": "Nabi Muhammad ﷺ dan Abu Bakar **berangkat secara sembunyi-sembunyi dan singgah di sebuah gua di Gunung Tsur selama tiga hari",
    "sirah": "Nabi Muhammad ﷺ dan Abu Bakar **berangkat secara sembunyi-sembunyi dan singgah di sebuah gua di Gunung Tsur selama tiga hari**. Abdullah bin Abu Bakar, seorang pemuda cerdik, akan menginap bersama mereka dan melaporkan berita dari Makkah. Amir bin Fuhairah, pelayan Abu Bakar, akan menggembalakan kambing di dekat gua untuk menghapus jejak kaki.\n \n Kisah Suraqah bin Malik, yang mengejar Nabi Muhammad ﷺ untuk mendapatkan hadiah 100 unta dari Quraisy, menunjukkan mukjizat kenabian. **Ketika Suraqah memacu kudanya mendekati Nabi, kedua kaki depan kudanya tiba-tiba terperosok ke tanah dan Suraqah pun terjatuh**. Ia mengulangi usahanya beberapa kali, namun setiap kali kudanya terjatuh. Suraqah pun menyadari bahwa Muhammad terlindungi dan mengakui kebenarannya. Ia berteriak meminta Nabi menunggu dan ingin berbicara. Abu Bakar menyampaikan permintaannya, dan Nabi Muhammad meminta Abu Bakar menulis jaminan keamanan untuk Suraqah di atas tulang atau tembikar. Suraqah menyimpan tulisan itu dan kembali tanpa mengingat kejadian itu, hingga ia bertemu Nabi lagi setelah Penaklukan Makkah dan masuk Islam.",
    "year": "622 M",
    "page": 9
  },
  {
    "title": "Persaudaraan Muhajirin dan Anshar",
    "description": "Setelah hijrah ke Madinah, Nabi Muhammad ﷺ menetapkan sistem persaudaraan istimewa antara kaum Muhajirin (pendatang) dan Anshar (penduduk Madinah) untuk mengatasi masalah ekonomi dan sosial, sekaligus menunjukkan solidaritas Islam.",
    "sirah": "Kaum Anshar menunjukkan kerelaan luar biasa dengan menghibahkan rumah dan tanah mereka kepada Muhajirin. Rasulullah ﷺ membangun rumah-rumah untuk Muhajirin di tanah yang dihibahkan dan tanah tidak bertuan. **Ketika Muhajirin merasa khawatir Anshar akan mengambil semua pahala karena kemurahan hati mereka, Rasulullah ﷺ bersabda: “Tidak, selama kalian tetap memuji mereka dan tetap berdoa kepada Allah untuk kebaikan mereka.”**.\n \n Undang-undang persaudaraan, yang disyariatkan di rumah Anas bin Malik, mempersaudarakan 90 orang (45 Muhajirin dan 45 Anshar). **Persaudaraan ini mencakup saling membantu secara mutlak dalam segala problem kehidupan, baik moril maupun materil, bahkan saling mewarisi meskipun tidak ada hubungan kekerabatan**. Ini adalah solusi bagi masalah yang dihadapi Daulah Islamiyah.\n \n Contoh nyata adalah Abdurrahman bin Auf dan Sa'ad bin Ar-Rabi'. Sa'ad menawarkan Abdurrahman sebagian hartanya dan salah satu dari dua istrinya untuk diceraikan, namun Abdurrahman menolak, meminta ditunjukkan jalan ke pasar. **Abdurrahman bin Auf akhirnya menjadi saudagar muslim yang kaya, suka memberi namun enggan menerima**.",
    "year": "622 M",
    "page": 10
  },
  {
    "title": "Perang Badar",
    "description": "Perang Badar Kubra pada tahun ke-2 Hijriyah adalah pertempuran besar pertama antara Muslimin dan Quraisy, yang dimenangkan oleh Muslimin dengan bantuan ilahi, menegaskan kemenangan akidah Islam dan mengubah dinamika kekuasaan di Jazirah Arab.",
    "sirah": "Perang Badar terjadi pada 17 Ramadhan. Malam sebelum perang, Rasulullah ﷺ berdoa tanpa henti, mengangkat tangan beliau menghadap kiblat hingga selendangnya jatuh dari bahu. **Abu Bakar datang dan mengembalikan selendang itu seraya berkata: “Wahai Nabi Allah, cukuplah engkau berdoa kepada Allah, sungguh Allah akan memenuhi apa yang Ia janjikan kepadamu.”**. Allah menurunkan ayat QS Al-Anfal: 9, menjanjikan bala bantuan seribu malaikat.\n \n Rasulullah ﷺ turun langsung ke medan pertempuran. Ketika musuh mendekat, beliau memerintahkan untuk memanah dan mendahului mereka dengan anak panah. Beliau juga melemparkan batu kerikil ke wajah kaum musyrikin. **Al-Qur'an mengabadikan ini dalam QS Al-Anfal: 17: “Maka (yang sebenarnya) bukan kamu yang membunuh mereka, akan tetapi Allah yang membunuh mereka, dan bukan kamu yang melempar ketika kamu melempar, tetapi Allah-lah yang melempar ....”**.\n \n Beberapa pembesar musyrikin tewas, termasuk Abu Jahal, yang dijuluki 'Fir'aun umat ini'. Ia dibunuh oleh dua pemuda Anshar, Mu'adz bin Amru bin Al-Jamuh dan Muw'adz bin 'Afra', setelah Abdurrahman bin Auf menunjukkan kepadanya siapa Abu Jahal. Abdullah bin Mas'ud menghabisi Abu Jahal yang sudah lumpuh. Umayyah bin Khalaf, penyiksa Bilal, juga tewas.\n \n Setelah perang, Rasulullah ﷺ musyawarah dengan Abu Bakar dan Umar mengenai tawanan. **Abu Bakar mengusulkan untuk menerima tebusan, sedangkan Umar mengusulkan agar mereka dibunuh karena mereka adalah pemimpin kekafiran**. Rasulullah condong kepada usulan Abu Bakar. Kemudian turunlah ayat QS Al-Anfal: 67-68 yang selaras dengan pendapat Umar, menegur Nabi karena menerima tebusan sebelum melumpuhkan musuh sepenuhnya.\n \n Perang Badar, meskipun kecil, merupakan **penentu dalam sejarah Islam, memisahkan antara hak (kebenaran) dan batil (kebatilan)**. Maslahat akidah Islam mengatasi seluruh maslahat dan hubungan duniawi. Kaum Anshar berkomitmen membela akidah tanpa syarat, dan kaum Muhajirin menghadapi kerabat mereka sendiri tanpa ragu membunuh mereka demi akidah. Setelah Badar, banyak orang masuk Islam, termasuk yang munafik, dan kaum Muslimin di Madinah mendapat tempat tinggi di atas Yahudi dan musyrikin.",
    "year": "624 M",
    "page": 11
  },
  {
    "title": "Perang Uhud",
    "description": "Terjadi pada tahun ke-3 Hijriyah, Perang Uhud adalah upaya balas dendam Quraisy yang menghasilkan kekalahan bagi Muslimin akibat ketidakpatuhan pemanah, namun menunjukkan keteguhan Rasulullah ﷺ dan para sahabat.",
    "sirah": "Sebelum Perang Uhud, Nabi Muhammad ﷺ melihat mimpi buruk: pedangnya patah (diartikan sebagai musibah yang menimpa kaum Mukminin di Uhud) dan melihat sapi disembelih (diartikan sebagai banyaknya korban dari kaum Mukminin).\n \n Rasulullah ﷺ bermusyawarah dengan para sahabat mengenai taktik perang. Beliau ingin bertahan di Madinah, memanfaatkan benteng kota yang kokoh. Namun, **mayoritas sahabat, terutama mereka yang tidak ikut Badar, bertekad bulat untuk keluar menyambut musuh**. Rasulullah ﷺ akhirnya menerima pendapat mayoritas. Ini menunjukkan pentingnya musyawarah dan kebebasan berpendapat dalam Islam.\n \n Dalam perjalanan, sekelompok kaum munafik di bawah pimpinan Abdullah bin Ubay bin Salul mundur dan kembali ke Madinah. Abdullah bin Amru bin Haram berusaha membujuk mereka, namun mereka menolak. Allah menyingkap kemunafikan mereka dalam Al-Qur'an, dan sahabat berselisih apakah mereka harus dihukum mati.\n \n Rasulullah ﷺ menempatkan pasukan pemanah di atas Gunung Uhud dan **memerintahkan mereka untuk tidak meninggalkan posisi mereka, bahkan jika mereka melihat pasukan Muslim disambar burung atau berhasil mengalahkan musuh**.\n \n Di fase awal pertempuran, kaum Muslimin berhasil memukul mundur musyrikin. Namun, **pasukan pemanah melanggar perintah Nabi dan turun dari gunung untuk mengumpulkan harta rampasan**, mengira Hawazin sudah kalah. Khalid bin Walid, yang saat itu masih musyrik, melihat celah ini dan menyerang dari belakang, mengubah jalannya pertempuran. **Banyak sahabat gugur, termasuk paman Nabi, Hamzah, yang dibunuh secara pengecut oleh Wahsyi**. Pembawa panji Islam, Mush'ab bin Umair, juga gugur.\n \n Rasulullah ﷺ sendiri menderita luka-luka, gigi taringnya patah, dan wajahnya terluka. Darah mengalir dari wajahnya. Beliau berseru: “Bagaimana bisa beruntung satu kaum yang melukai wajah Nabi mereka, sedang ia mengajak mereka kepada Islam!”. Meskipun demikian, beliau berdoa: “Ya Allah ampunilah kaumku karena mereka tidak tahu.”.\n \n **Amru bin Al-Jamuuh, seorang yang pincang dan diberi keringanan untuk tidak berjihad, bersikeras ikut perang demi mati syahid.** Ia bertanya kepada Rasulullah apakah ia bisa menapakkan kakinya yang pincang di surga jika terbunuh, dan Nabi menjawab: “Ya!” Amru maju dan gugur syahid.\n \n Beberapa wanita ikut serta di Uhud, seperti Ummu Ammarah Nusaibah binti Ka'ab yang melindungi Nabi hingga terluka, dan Hamnah binti Jahsy yang memberi minum dan mengobati prajurit.\n \n Setelah kekalahan, Allah menurunkan ketenangan berupa kantuk yang meliputi sebagian pasukan, sementara munafikin mencemaskan diri mereka. Ini menunjukkan perbedaan antara mukminin sejati dan munafikin.",
    "year": "625 M",
    "page": 12
  },
  {
    "title": "Perang Khandaq (Ahzab)",
    "description": "Pada tahun ke-5 Hijriyah, Perang Khandaq terjadi akibat persekongkolan Yahudi Bani Nadhir dengan Quraisy dan kabilah-kabilah lain untuk menyerbu Madinah, yang diatasi Muslimin dengan strategi parit dan bantuan ilahi.",
    "sirah": "Perang Khandaq terjadi ketika Yahudi Bani Nadhir (yang diusir dari Madinah) menghasut Quraisy dan kabilah Ghathafan untuk menyerang Madinah. Mereka membentuk persekongkolan (Al-Ahzab) dan mengepung Madinah dengan sekitar sepuluh ribu pasukan.\n \n **Salman Al-Farisi memberikan ide untuk menggali parit di daerah utara Madinah**, satu-satunya sisi terbuka bagi musuh. Sisi lain kota terlindungi oleh bangunan dan perkebunan kurma. Panjang parit sekitar 5.000 hasta dan lebar 9 hasta. Kaum Muslimin, meskipun dalam kondisi dingin dan kelaparan, menggali parit dengan semangat tinggi. **Rasulullah ﷺ juga ikut menggali, mengangkut tanah hingga perutnya berdebu dan mengganjal perutnya dengan batu karena lapar**. Beliau memecahkan batu-batu besar yang sulit dipecahkan sahabat dengan cangkulnya.\n \n Saat penggalian, Rasulullah ﷺ memberitakan **mukjizat berupa kunci-kunci negeri Syam, Persia, dan Yaman yang akan ditaklukkan, meskipun mereka sedang dalam kondisi dingin dan lapar di sekitar parit**. Orang-orang munafik mengejek berita gembira ini.\n \n Selama pengepungan, Bani Quraizhah, sekutu Yahudi di Madinah, mengkhianati perjanjian dan bergabung dengan Quraisy. Rasulullah ﷺ mengutus sahabat untuk mengecek kebenaran berita ini. Allah menyingkap kepanikan kaum Muslimin dan prasangka munafikin dalam Al-Qur'an.\n \n Lamanya pengepungan melemahkan semangat pasukan Ahzab. **Allah mengirimkan angin topan dan tentara tak terlihat (malaikat) yang membuat kemah-kemah mereka porak-poranda dan memadamkan api mereka**. Hudzaifah bin Yaman diutus Nabi untuk menyelidiki kondisi musuh dan melaporkan bahwa pasukan musyrikin telah bubar.",
    "year": "627 M",
    "page": 13
  },
  {
    "title": "Perjanjian Hudaibiyah",
    "description": "Pada tahun ke-6 Hijriyah, Rasulullah ﷺ melakukan perjalanan umrah yang dihalangi Quraisy, berakhir dengan perjanjian damai di Hudaibiyah yang meskipun awalnya dianggap merugikan, justru membawa kemenangan besar bagi dakwah Islam dan membuka jalan bagi konsolidasi Muslimin.",
    "sirah": "Rasulullah ﷺ dan para sahabat **berangkat untuk umrah, membawa hewan kurban, tidak membawa senjata perang berat, hanya pedang yang disarungkan**. Ini untuk menunjukkan tujuan damai. Namun, Quraisy berusaha menghalangi mereka.\n \n Rasulullah ﷺ mengirim utusan kepada Quraisy untuk menjelaskan tujuan mereka datang untuk umrah, bukan perang. Umar bin Khattab awalnya akan diutus, namun digantikan oleh Utsman bin Affan karena Umar dikenal keras permusuhannya terhadap Quraisy. Utsman ditahan lama oleh Quraisy, sehingga tersebar kabar ia dibunuh, yang memicu **Bai'at Ar-Ridhwan, di mana para sahabat berbai'at kepada Nabi untuk berperang hingga mati**. \nPerjanjian Hudaibiyah disepakati dengan Suhail bin Amr sebagai perwakilan Quraisy. Isi perjanjiannya antara lain:\n*   Gencatan senjata selama 10 tahun.\n*   Barangsiapa datang kepada Rasulullah tanpa izin walinya harus dikembalikan, sedangkan yang datang kepada Quraisy dari sahabat Nabi tidak dikembalikan.\n*   Tidak ada pencurian dan penghunusan pedang.\n*   Kabilah-kabilah bebas bersekutu dengan Muhammad atau Quraisy. Bani Khuza'ah segera bersekutu dengan Nabi, dan Bani Bakar dengan Quraisy.\n*   Kaum Muslimin kembali tahun itu dan baru boleh masuk Makkah tahun depan selama tiga hari, membawa senjata yang disarungkan. \n \n**Umar bin Khattab sangat marah dan mempertanyakan perjanjian ini kepada Nabi Muhammad ﷺ**. Ia merasa bahwa kaum Muslimin mengalah dalam agama mereka. Nabi menegaskan bahwa beliau adalah utusan Allah dan tidak akan melanggar perintah-Nya. Umar juga bertanya apakah Nabi tidak mengatakan bahwa mereka akan thawaf di Ka'bah. Nabi menjawab: “Ya, tapi apakah saya memberitahukan kepadamu bahwa kamu akan datang tahun ini?” Umar menjawab: “Tidak.” Beliau bersabda: “Maka kamu akan mendatanginya dan thawaf disekelilingnya.”. Umar bahkan mengulanginya kepada Abu Bakar, yang menjawab: **“Wahai Umar ikuti saja perkataan Rasulullah seperti adanya, maka sesungguhnya saya bersaksi bahwa dia adalah utusan Allah.”**. Umar menyesali perkataannya dan terus berpuasa, bersedekah, dan memerdekakan budak sebagai penebusnya.\n \n **Perjanjian ini terasa menyakitkan bagi Muslim, terutama ketika Abu Jandal, yang datang mencari perlindungan Muslim, harus dikembalikan kepada Quraisy**. Nabi ﷺ menasihati Abu Jandal untuk bersabar, karena Allah akan memberikan jalan keluar.\n \n Setelah perjanjian, para sahabat enggan menyembelih hewan kurban dan mencukur rambut mereka. Nabi Muhammad ﷺ, atas usulan Ummu Salamah, menyembelih hewan kurban dan mencukur rambutnya sendiri, baru kemudian para sahabat mengikutinya.",
    "year": "628 M",
    "page": 14
  },
  {
    "title": "Fathu Makkah (Penaklukan Makkah)",
    "description": "Penaklukan Makkah pada tahun ke-8 Hijriyah adalah konsekuensi dari pelanggaran Perjanjian Hudaibiyah oleh Quraisy. Rasulullah ﷺ memimpin pasukan besar untuk memasuki Makkah dengan damai, mengumumkan amnesti umum, dan membersihkan Ka'bah dari berhala, menandai berakhirnya paganisme di pusat Jazirah Arab.",
    "sirah": "Quraisy melanggar Perjanjian Hudaibiyah dengan menyerang Bani Khuza'ah, sekutu Nabi. Mereka menolak tawaran Nabi untuk membayar diyat atau memutuskan persekutuan dengan Bani Bakr, malah memilih perang. Kemudian mereka menyesal dan mengirim Abu Sufyan untuk memperbarui perjanjian, namun ia gagal.\n \n **Hathib bin Abi Balta'ah mencoba mengirim surat rahasia kepada Quraisy untuk memberitahukan kedatangan pasukan Muslim**. Namun, Nabi Muhammad ﷺ diberi tahu melalui wahyu. Beliau mengutus Ali dan Az-Zubair untuk mencegat wanita pembawa surat di Rauhata. Ketika diinterogasi, wanita itu awalnya menyangkal, namun setelah diancam akan digeledah, ia mengeluarkan surat dari kepangan rambutnya. Nabi memanggil Hathib, yang beralasan ia tidak memiliki kerabat di Makkah yang bisa melindungi keluarganya seperti Muhajirin lain. **Umar bin Khattab ingin memenggal leher Hathib karena dianggap munafik, namun Nabi bersabda: “Sesungguhnya dia pernah mengikuti Perang Badar. Boleh jadi Allah sudah mengetahui isi hati orang yang pernah mengikuti Perang Badar, lalu berkata: Berbuatlah sesuka kalian, Aku telah mengampuni dosa-dosa kalian.”**.\n \n Rasulullah ﷺ memasuki Makkah dari arah atas (Kada'). Perlawanan Quraisy sangat kecil, hanya sedikit yang terbunuh. Nabi menginstruksikan komandan perang untuk tidak memerangi kecuali yang memerangi mereka. Beliau mengumumkan keamanan umum, kecuali untuk beberapa individu yang darahnya dihalalkan karena kejahatan mereka.\n \n **Hampir seluruh penduduk Makkah memperoleh ampunan secara umum, meskipun banyak gangguan yang mereka timpa kepada Nabi dan dakwah beliau**. Seruan maaf ini disampaikan ketika mereka berkumpul di Ka'bah. Nabi memilih untuk memaafkan dan bersabar, karena itulah yang lebih baik. Kota Makkah tidak diperlakukan seperti kota taklukan lainnya, melainkan dihormati kesuciannya sebagai pusat ibadah.\n \n Setelah penaklukan, Nabi Muhammad ﷺ membersihkan Ka'bah dari berhala-berhala dan mengutus Khalid bin Al-Walid untuk menghancurkan berhala Uzza di Nakhlah. Beliau juga mengutus Amr bin Al-Ash untuk menghancurkan Suwa' dan Sa'ad bin Zaid Al-Asyhaly untuk menghancurkan Manat.\n \n Nabi Muhammad ﷺ berpidato beberapa kali di Makkah. Salah satu pidato di pintu Ka'bah menjelaskan tentang diyat (tebusan) untuk pembunuhan yang keliru, menghapuskan kekuasaan Jahiliyah kecuali hak memberi minum jamaah haji dan mengurus Ka'bah. Pidato kedua mengumumkan bubarnya persekutuan Jahiliyah kecuali yang di atas kebaikan dan menolong kebenaran. Pidato ketiga menjelaskan kesucian Makkah, keharaman berburu, mencabut duri, menebang pohon, mengambil barang temuan, dan menumpahkan darah di dalamnya.",
    "year": "630 M",
    "page": 15
  },
  {
    "title": "Perang Hunain dan Tha'if",
    "description": "Segera setelah Fathu Makkah, Muslimin menghadapi kabilah Hawazin dan Tha'if dalam Perang Hunain, di mana kemenangan diraih setelah menghadapi kemunduran awal. Kemudian, pasukan Muslimin mengepung Tha'if, yang meskipun tidak berhasil ditaklukkan melalui pengepungan, akhirnya pemimpinnya memeluk Islam kemudian.",
    "sirah": "Perang Hunain terjadi tak lama setelah Fathu Makkah, melawan kabilah Hawazin dan Tsaqif yang berambisi mengisi kekosongan kekuatan Quraisy. Jumlah pasukan Muslim saat itu besar, sekitar 12.000 orang. **Beberapa Muslim sempat merasa bangga dengan banyaknya jumlah mereka, berkata: “Mereka tidak akan dikalahkan oleh jumlah yang sedikit.” Perasaan ini ditegur dalam Al-Qur'an (QS At-Taubah: 25)**.\n \n Di awal perang, pasukan Hawazin menyerang secara mendadak dengan panah dari lembah, menyebabkan pasukan Muslim terkejut dan lari mundur. **Hanya sekitar 10-12 sahabat yang bertahan bersama Rasulullah ﷺ**. Nabi ﷺ memerintahkan pamannya, Al-Abbas (yang bersuara lantang), untuk memanggil kembali pasukan yang terpencar, terutama kaum Anshar dan mereka yang ikut Bai'at Ar-Ridhwan. Pasukan Muslimin akhirnya berkumpul kembali, berjumlah sekitar 80-100 orang, dan memulai babak baru pertempuran dengan semangat baru. Rasulullah ﷺ berdoa memohon kemenangan, bahkan turun dari kudanya dan berjalan kaki di tengah perang. **Beliau memungut segenggam pasir atau kerikil dan melontarkannya ke wajah orang-orang kafir, yang melemahkan kekuatan mereka**.\n \n Rasulullah ﷺ melarang membunuh wanita dan anak-anak dalam perang. Beliau menegaskan bahwa semua manusia dilahirkan dalam keadaan fitrah (Islam).\n \n Setelah Hunain, kaum Muslimin mengepung Tha'if. Nabi Muhammad ﷺ memerintahkan untuk membakar kebun anggur dan kurma di sekitar Tha'if untuk menekan Tsaqif, yang akhirnya meminta beliau menghentikannya. Nabi memenuhi permintaan mereka. Beliau tidak ingin memberatkan kaum Muslimin dengan banyak korban untuk menaklukkan kota yang kuat ini, karena pada akhirnya mereka akan masuk Islam atau menyerah.\n \n Ketika Tha'if dikepung, beberapa sahabat meminta Nabi mendoakan kebinasaan bagi penduduknya, namun beliau justru berdoa: **“Ya Allah, berilah petunjuk bagi orang-orang Tsaqif!”**.",
    "year": "630 M",
    "page": 16
  },
  {
    "title": "Pembagian Harta Rampasan Hunain",
    "description": "Setelah kemenangan di Perang Hunain, Rasulullah ﷺ melakukan pembagian harta rampasan yang melimpah, mengutamakan 'mu'allafat al-qulub' (mereka yang dilembutkan hatinya) untuk menguatkan iman mereka, sebuah kebijakan yang menjelaskan hikmah di balik tindakan Nabi ﷺ.",
    "sirah": "Harta rampasan Hunain sangat melimpah. Rasulullah ﷺ sengaja menunda pembagiannya, menunggu utusan Hawazin datang dan masuk Islam. Setelah mereka datang, Nabi memberikan pilihan antara harta rampasan atau tawanan. Mereka memilih tawanan. Rasulullah ﷺ kemudian berkhutbah kepada kaum mukmin, menjelaskan bahwa Hawazin adalah saudara mereka yang bertaubat, dan meminta mereka mengembalikan tawanan. Kebanyakan prajurit setuju, kecuali beberapa yang memiliki tawanan pribadi.\n \n Nabi Muhammad ﷺ memberikan bagian yang besar dari harta rampasan kepada `Ath-Thulaqaa` (para pemuka Makkah yang baru masuk Islam saat penaklukan Makkah) dan `Al-A'raab` (orang-orang Badui) untuk melunakkan hati mereka. **Kebijakan ini membuat orang-orang Anshar merasa tidak adil, karena mereka tidak diberi bagian yang sama**. Nabi Muhammad ﷺ menjelaskan kepada mereka: **“Demi Allah, sesungguhnya aku memberi sesuatu kepada seseorang dan aku tidak memberi apapun kepada yang lain. Dan yang tidak aku beri sesuatu, lebih aku cintai daripada yang aku beri. Akan tetapi aku memberi sesuatu kepada beberapa kaum, karena aku melihat hati-hati mereka masih diliputi rasa cemas dan gelisah. Dan aku pasrahkan beberapa kaum yang lain kepada apa yang telah ditetapkan Allah dalam hati mereka berupa perasaan cukup dan puas.”**.\n \n Beliau juga bersabda: “Sesungguhnya aku memberi sesuatu kepada beberapa orang yang baru saja melepaskan ikatan kekufuran, dengan tujuan untuk mengambil hati mereka.”. Nabi bertanya kepada Anshar: **“Tidakkah kalian berkenan hati jika orang-orang lain kembali dengan membawa dunia, sedangkan kalian kembali bersama Rasulullah ke tempat tinggal kalian? Seandainya orang-orang menempuh jalan di suatu lembah, sedangkan orang-orang Anshar menempuh jalan di lembah yang lain, niscaya aku lebih memilih untuk menempuh jalan yang dilalui oleh orang-orang Anshar.”**. Setelah penjelasan ini, Anshar menerima kebijakan tersebut.",
    "year": "630 M",
    "page": 17
  },
  {
    "title": "Perang Tabuk",
    "description": "Perang Tabuk pada tahun ke-9 Hijriyah adalah ekspedisi militer besar pertama melawan Kekaisaran Romawi, di mana Muslimin berhasil mencapai Tabuk meskipun tanpa pertempuran langsung, menunjukkan kekuatan Islam di tengah berbagai kesulitan dan sekaligus mengungkap identitas kaum munafik.",
    "sirah": "Perang Tabuk adalah peperangan terakhir yang diikuti oleh Nabi Muhammad ﷺ. Krisis ekonomi melanda pasukan, sehingga mereka makan sebiji kurma secara bergantian. Rasulullah ﷺ memotivasi para sahabat untuk berinfak. **Utsman bin Affan berinfak sangat besar, dan ada seorang laki-laki miskin menyumbang sedikit kurma, yang dicela oleh kaum munafik dengan mengatakan: “Sesungguhnya Allah Maha Kaya, tidak lagi membutuhkan sedekah seperti ini!!”**. Allah menurunkan ayat QS At-Taubah: 79 untuk menegur munafik.\n \n Perang ini menyingkap jelas kemunafikan. Munafikin menghalang-halangi orang untuk berperang dengan mengatakan: “Janganlah kalian pergi berperang dalam panas terik ini.”. Mereka mengajukan berbagai alasan untuk tidak ikut. Nabi Muhammad ﷺ menerima alasan yang tampak, namun menyerahkan apa yang tersembunyi dalam hati mereka kepada Allah. Al-Qur'an dengan jelas menggolongkan mereka sebagai najis dan kotor, menciptakan dinding pemisah antara mukminin dan munafikin. **Ka'ab bin Malik, Hilal bin Umayyah, dan Murarah bin Ar-Rabi' adalah tiga sahabat Anshar yang jujur mengakui tidak memiliki alasan untuk tidak ikut perang, dan sebagai hukumannya, Nabi melarang sahabat lain berbicara dengan mereka selama 50 hari**. Istri-istri mereka juga diperintahkan menjauhi mereka. Bumi yang luas terasa sempit bagi mereka. Akhirnya, Allah menerima taubat mereka.\n \n **Dalam perjalanan pulang dari Tabuk, sekelompok munafik mencoba membuat unta Nabi Muhammad ﷺ lari di bukit untuk menjatuhkan beliau**. Nabi tanggap terhadap gelagat mereka.",
    "year": "631 M",
    "page": 18
  },
  {
    "title": "Haji Wada' (Haji Perpisahan)",
    "description": "Pada tahun ke-10 Hijriyah, Rasulullah ﷺ melaksanakan haji pertamanya dan terakhirnya, yang dikenal sebagai Haji Wada', di mana beliau menyampaikan khutbah penting yang menyempurnakan ajaran Islam, menegaskan nilai-nilai universal, dan menjadi pedoman bagi umat.",
    "sirah": "Haji Wada' adalah satu-satunya haji yang dilakukan Nabi Muhammad ﷺ setelah hijrah. Beliau berkhutbah di Arafah, di antara pesannya: **“Seluruh riba pada masa Jahiliyah telah dihapus, dan riba Abbas bin Abdul Muththalib juga dihapus.”**. Beliau juga berpesan untuk bertakwa kepada Allah dalam memperlakukan wanita, karena mereka diambil dengan amanah Allah. Beliau meninggalkan Al-Qur'an sebagai pedoman agar umat tidak tersesat. Beliau bertanya kepada umat: “Jika kalian ditanya tentang diriku maka apakah jawaban kalian?” Mereka menjawab: “Kami bersaksi bahwa engkau telah menyampaikan (risalah), menunaikan amanah, dan menasihati umat.” Nabi pun berkata: “Ya Allah, persaksikanlah! Ya Allah, persaksikanlah!”. Beliau juga berkhutbah di Mina, salah satu isinya: **“Janganlah kalian kembali kafir setelahku disebabkan sebagian kalian menumpahkan darah sebagian lainnya.”**. Dalam perjalanan kembali, di Ghadir Khum, beliau memegang tangan Ali bin Abi Thalib dan berkata: **“Barangsiapa yang menjadikan aku sebagai walinya maka Ali juga walinya.”**.",
    "year": "632 M",
    "page": 19
  },
  {
    "title": "Wafatnya Rasulullah",
    "description": "Pada tahun ke-11 Hijriyah, Nabi Muhammad ﷺ wafat setelah menyelesaikan misinya menyempurnakan Islam, meninggalkan umat dengan ajaran yang lengkap dan sempurna.",
    "sirah": "Setelah menyempurnakan risalah Islam dan menyatukan Jazirah Arab di bawah panji tauhid, Rasulullah ﷺ mulai menunjukkan tanda-tanda akhir hayatnya. Pada akhir hayat beliau ﷺ, terjadi peristiwa-peristiwa penting. Beliau ﷺ jatuh sakit, dan dalam sakitnya, beliau ﷺ menunjuk Abu Bakar Ash-Shiddiq ﷺ untuk mengimami shalat.\n \n Salah satu tanda kenabian yang terjadi menjelang wafatnya adalah ketika Rasulullah ﷺ berbicara dengan putrinya, Fathimah, di mana awalnya Fathimah menangis kemudian tersenyum setelah diberitahu bahwa ia akan menjadi orang pertama dari keluarganya yang menyusul beliau ﷺ. **Rasulullah ﷺ wafat pada hari Senin**, dan para sahabat sangat terpukul dan bingung. Abu Bakar Ash-Shiddiq ﷺ kemudian menegaskan kewafatan Nabi ﷺ kepada kaum Muslimin, dengan membaca ayat Al-Qur'an untuk menenangkan mereka. Kewafatan beliau ﷺ menandai berakhirnya masa kenabian dan telah sempurnanya risalah Islam, yang beliau sampaikan kepada para sahabat, dan mereka kemudian menyampaikannya kepada seluruh umat manusia. Rasulullah ﷺ memperingatkan pengikutnya agar tidak menuhankan beliau ﷺ, dan menegaskan status beliau ﷺ sebagai manusia biasa yang diutus oleh Allah ﷺ.",
    "year": "632 M",
    "page": 20
  }
]
